IDEA Open Model
ConcreteSLSCheckResultCrackWidth Class
Compatible with IDEA StatiCa 20.1
 SLS Check Crack width base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteCheckResultBase
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultCrackWidth
 IdeaRS.OpenModel.Concrete.CheckResult.ConcreteSLSCheckResultCrackWidthEc2
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public abstract class ConcreteSLSCheckResultCrackWidth : ConcreteCheckResultBase
Public MustInherit Class ConcreteSLSCheckResultCrackWidth
	Inherits ConcreteCheckResultBase
The ConcreteSLSCheckResultCrackWidth type exposes the following members.
Constructors
Name | Description
ConcreteSLSCheckResultCrackWidth
Initializes a new instance of the ConcreteSLSCheckResultCrackWidth class
Top
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.CheckResult Namespace